{
    "nav_home": "🚀 Accueil",
    "nav_about": "👨‍🚀 À propos",
    "nav_projects": "⚙️ Projets",
    "nav_resume": "📄 CV",
    "nav_contact": "📡 Contact",

    "featured_projects_title": "Projets mis en avant",
    "featured_badge": "En vedette",
    "other_projects_title": "Autres projets",

    "home_name": "Adrien CLAUDE",
    "home_network_gameplay_programmer": "Programmeur Réseau & Gameplay",
    "home_presentation": "Bienvenue ! Je m'appelle Adrien, j'ai 20 ans et je suis passionné par l'espace, la programmation et les jeux vidéo. Je me concentre sur le développement de jeux, en particulier la programmation réseau, pour créer des expériences multijoueur fluides et captivantes.",
    "home_programming_language": "Langages de programmation",
    "home_cpp": "C++",
    "home_csharp": "C#",
    "home_c": "C",
    "home_engine_framework": "Moteurs et Frameworks",
    "home_unity": "Unity Engine",
    "home_sfml": "SFML",
    "home_software_tools": "Logiciels et Outils",
    "home_visual_studio": "Visual Studio",
    "home_visual_studio_code": "Visual Studio Code",
    "home_cmake": "CMake",
    "home_github": "Github",
    "home_tortoise_svn": "TortoiseSVN",
    "home_doxygen": "Doxygen",

    "about_name": "Adrien CLAUDE",
    "about_title": "Programmeur Réseau & Gameplay",
    "about_description_1": "Depuis mon enfance, je suis fasciné par les mondes virtuels et les possibilités infinies qu'ils offrent. Ce qui a commencé par des heures passées à jouer s'est transformé en une passion pour comprendre leur fonctionnement et en créer de nouveaux. J'aime concevoir des expériences qui connectent les gens, en particulier à travers la programmation réseau et les jeux multijoueur, relever des défis techniques et donner vie à de nouvelles idées.",
    "about_description_2": "Avec le temps, une autre passion s'est emparée de moi : l'espace. Son immensité et ses mystères nourrissent mon imagination et influencent ma manière d'aborder la création. Pour moi, les mondes virtuels et l'univers partagent la même essence : explorer l'inconnu, repousser les limites et inventer de nouveaux horizons.",
    "about_passion_icon": "❤️",
    "about_passion_title": "Ce qui me passionne",
    "about_passion_content": "J'ai grandi fasciné par les mondes virtuels et l'infinité de l'espace. Aujourd'hui, rien ne me rend plus heureux que de créer des expériences qui connectent les gens ou de rêver aux mystères de l'univers. Chaque défi technique surmonté, chaque idée concrétisée, est une petite victoire qui me pousse à explorer encore plus loin.",
    "about_objective_icon": "🎯",
    "about_objective_title": "Mes objectifs",
    "about_objective_content": "Mon objectif est de combiner mes passions pour les mondes virtuels et l'espace en créant des expériences immersives. Je vise à concevoir des projets où la programmation réseau permet aux joueurs de se connecter et d'explorer ensemble de nouveaux univers.",

    "gameProjects_separator": "→",
    "gameProjects_team_icon": "👥",

    "gameProjects_skill_c#": "C#",
    "gameProjects_skill_c++": "C++",
    "gameProjects_skill_c": "C",

    "gameProjects_skill_unity": "Unity",
    "gameProjects_skill_dots": "DOTS",

    "gameProjects_skill_sfml": "SFML",
    "gameProjects_skill_csfml": "CSFML",

    "gameProjects_skill_windows": "Windows",
    "gameProjects_skill_posix": "POSIX",
    "gameProjects_skill_android": "Android",

    "gameProjects_skill_multiplayer": "Multijoueur",
    "gameProjects_skill_fps": "FPS",
    "gameProjects_skill_competitive": "Compétitif",
    "gameProjects_skill_farm_gane": "Jeu de ferme",
    "gameProjects_skill_roguelike": "Roguelike",
    "gameProjects_skill_board_game": "Jeu de plateau",
    "gameProjects_skill_turn_based_tactics": "Tactique au tour par tour",

    "gameProjects_skill_network_engine": "Moteur réseau",
    "gameProjects_skill_winsock": "Winsock",
    "gameProjects_skill_bsd_sockets": "BSD sockets",

    "gameProjects_title_tme": "Travelers Multiplayer Engine",
    "gameProjects_start_tme": "Juin 2025",
    "gameProjects_end_tme": "Aujourd'hui",
    "gameProjects_team_size_tme": "1 personne",
    "gameProjects_description_tme": "Moteur réseau C++ multiplateforme conçu pour simplifier le développement de jeux multijoueur. Il prend en charge Windows (via Winsock) et les systèmes compatibles POSIX (via BSD sockets).",

    "gameProjects_title_suna": "Suna",
    "gameProjects_start_suna": "Janv. 2025",
    "gameProjects_end_suna": "Mai 2025",
    "gameProjects_team_size_suna": "10 personnes",
    "gameProjects_description_suna": "FPS compétitif dans le style de Counter-Strike. Vous jouez soit les Natifs, soit les Corporatifs. L'objectif d'une équipe est de planter le Récolteur, tandis que l'équipe adverse doit empêcher sa plantation ou le désamorcer s'il a déjà été déployé.",

    "gameProjects_title_fairy_fields": "Fairy Fields",
    "gameProjects_start_fairy_fields": "Oct. 2024",
    "gameProjects_end_fairy_fields": "Déc. 2024",
    "gameProjects_team_size_fairy_fields": "9 personnes",
    "gameProjects_description_fairy_fields": "Jeu de ferme mobile avec une touche magique. Construisez votre ferme pour cultiver des plantes et les transformer en potions pour répondre aux demandes des villageois. Vous pouvez également échanger en achetant et en vendant des objets avec d'autres joueurs.",

    "gameProjects_title_shattered_soul": "Shattered Soul",
    "gameProjects_start_shattered_soul": "Janv. 2024",
    "gameProjects_end_shattered_soul": "Mai 2024",
    "gameProjects_team_size_shattered_soul": "9 personnes",
    "gameProjects_description_shattered_soul": "Dans ce roguelike 2D en vue de dessus, vous incarnez une chevalière dont l'âme s'élève vers la Divinité à sa mort. Pour contenir ce nouveau pouvoir, elle doit vaincre un dieu et revendiquer son corps comme réceptacle.",

    "gameProjects_title_solar_storm": "Solar Storm",
    "gameProjects_start_solar_storm": "Oct. 2023",
    "gameProjects_end_solar_storm": "Déc. 2023",
    "gameProjects_team_size_solar_storm": "8 personnes",
    "gameProjects_description_solar_storm": "Dans ce jeu de plateau, vous devez travailler ensemble en équipe pour vous échapper de votre vaisseau qui dérive tout droit vers une tempête solaire. Pour survivre, vous devrez collecter du métal pour construire des navettes, tout en produisant de la nourriture et de l'eau. Mais attention, si vous manquez de l'un ou de l'autre, vous serez obligés de dire adieu à l'un des vôtres.",

    "gameProjects_title_land_of_hope": "Land Of Hope",
    "gameProjects_start_land_of_hope": "Avr. 2023",
    "gameProjects_end_land_of_hope": "Juin 2023",
    "gameProjects_team_size_land_of_hope": "9 personnes",
    "gameProjects_description_land_of_hope": "Dans ce jeu tactique au tour par tour, votre objectif est de conquérir les Terres Maudites. Vous commencerez par choisir votre héros et vos soldats, puis déplacerez vos troupes sur une carte tactique, avec des combats inspirés de Slay the Spire.",

    "resume_webp": "resume/CV_Adrien_Claude.webp",
    "resume_download_file": "resume/CV_Adrien_Claude.pdf",
    "resume_download_text": "Télécharger",

    "contact_contact_me": "Me contacter",
    "contact_email_text": "Email",
    "contact_email_address": "adrien.claude.88470@gmail.com",
    "contact_linkedin_text": "LinkedIn",
    "contact_linkedin_link": "linkedin.com/in/adrien-claude",

    "project_back_to_projects": "← Retour aux projets",
    "project_status_completed": "Terminé",
    "project_status_in_progress": "En cours",
    "project_overview_title": "Aperçu du projet",
    "project_role_title": "Mon rôle dans le projet",
    "project_role_responsibilities_title": "Mes Responsabilités :",
    "project_tech_title": "Technologies utilisées",
    "project_features_title": "Fonctionnalités clés",
    "project_challenges_title": "Défis techniques que j'ai rencontrés",
    "project_learnings_title": "Ce que j'ai appris",

    "project_title_suna": "Suna",
    "project_date_suna": "Jan. 2025 - Mai 2025",
    "project_team_size_suna": "Équipe de 10 personnes",
    "project_description_suna_1": "Suna est un jeu de tir à la première personne multijoueur compétitif inspiré de Counter-Strike. Dans ce jeu, deux équipes s’affrontent : les Corpos et les Natifs.",
    "project_description_suna_2": "En tant que Corpo, vous incarnez un robot de combat dont l’objectif est de planter un extracteur ou d’éliminer toute l’équipe ennemie. En tant que Natif, vous êtes l’un des habitants de la planète, et votre mission est de protéger vos ressources en empêchant les Corpos de planter l’extracteur ou en anéantissant leur équipe.",
    "project_role_position_suna": "Programmeur Réseau & Gameplay",
    "project_role_description_suna": "En tant que programmeur multijoueur et gameplay, j'ai eu la responsabilité d'implémenter la base du système de tir, la localisation et la gestion des dégâts, ainsi que la création d’un système d’animation hybride combinant l’ECS de Unity et son système d’animation basé sur les GameObjects. J’ai également intégré les animations et assuré la bonne réplication du joueur (déplacements, animations, tirs, dégâts), tout en veillant à ce que le jeu reste jouable malgré un ping conséquent.",
    "project_role_responsibility_suna_01": "Mise en place de différentes simulations en ECS (client/serveur).",
    "project_role_responsibility_suna_02": "Implémentation de la base du système de tir en réseau.",
    "project_role_responsibility_suna_03": "Localisation et gestion des dégâts liés au tir des joueurs.",
    "project_role_responsibility_suna_04": "Gestion des modèles FPS et TPS via des GameObjects, intégrés à l’ECS pour des opérations telles que la création, la destruction, le déplacement, la rotation et la réplication.",
    "project_role_responsibility_suna_05": "Mise en place d’un système d’animation hybride en réseau entre ECS de Unity et le système d’animation basé sur les GameObjects.",
    "project_role_responsibility_suna_06": "Implémentation des animations.",
    "project_role_responsibility_suna_07": "Système de la caméra FPS et du mode spectateur",
    "project_role_responsibility_suna_08": "Réplication des mouvements, des animations et des tirs du joueur.",
    "project_feature_title_suna_01": "Architecture réseaux avec autorité par le serveur",
    "project_feature_desc_suna_01": "L'architecture réseau sera composée de plusieurs clients et d'un serveur distinct, avec une autorité centralisée assurée par le serveur.",
    "project_feature_title_suna_02": "Système de Matchmaking",
    "project_feature_desc_suna_02": "Rassembler automatiquement les joueurs et de former des équipes pour lancer une partie rapidement.",
    "project_feature_title_suna_03": "Replication et coherance des actions du joueur",
    "project_feature_desc_suna_03": "Assurer la bonne réplication et la cohérence des déplacements, des animations et des actions du joueur, que ce soit avec un ping faible ou conséquent.",
    "project_feature_title_suna_04": "Déroulement d'une partie",
    "project_feature_desc_suna_04": "Met en place tout le déroulement d'une partie : phase d'achat, pose et désamorçage de l'extracteur, gestion des victoires et défaites, et transitions entre les différentes phases.",
    "project_feature_title_suna_05": "Système d'économie",
    "project_feature_desc_suna_05": "Gère l'économie du jeu : attribution de l'argent en fonction des actions, achats d'équipement en début de manche et gestion des récompenses ou pénalités selon les résultats.",
    "project_challenge_title_suna_01": "Système d'animation hybride en réseau",
    "project_challenge_desc_suna_01": "Pour ce projet, nous avons utilisé Unity DOTS, qui remplace le système classique de GameObjects de Unity par un système basé sur des entités (ECS). Étant donné que Unity DOTS est une technologie encore en développement, elle ne dispose pas de système d'animation intégré. L'une de mes responsabilités a donc été de créer un système hybride permettant de connecter l'ECS qui gère les valeurs et états des entités avec le système d'animation traditionnel de Unity, basé sur les GameObjects. Le tout en veillant à assurer une bonne réplication et synchronisation en réseau.",
    "project_challenge_solution_suna_01_title": "Solution adoptée :",
    "project_challenge_solution_suna_01_desc": "J'ai développé un système hybride qui utilise des buffers dynamiques pour stocker les paramètres d'animation (float, int, bool, trigger) sous forme de composants ECS avec synchronisation réseau via GhostComponent. Sur le serveur, un système collecte les changements d'état et les stocke dans ces buffers, tandis qu'un autre système les applique à l'Animator Unity traditionnel. Sur le client, le système reçoit automatiquement les données répliquées et met à jour les animations localement. Cette architecture permet une séparation claire entre la logique ECS et le rendu, tout en garantissant une synchronisation fluide des animations entre tous les joueurs connectés.",
    "project_learnings_desc_suna": "Ce projet a été pour moi une très belle expérience, qui m’a permis d’améliorer mes compétences, d’en acquérir de nouvelles, et de confirmer ma volonté de me spécialiser dans la programmation réseau. J’ai également eu l’occasion de travailler avec une très bonne équipe pour livrer un projet ambitieux dans un temps restreint.",
    "project_learning_suna_01": "Programmation d’un jeu multijoueur en réseau avec prédiction, réplication, synchronisation et autorité côté serveur.",
    "project_learning_suna_02": "Découverte et apprentissage de la programmation orientée ECS (Entity Component System).",
    "project_learning_suna_03": "Amélioration de mes compétences en travail d’équipe et en communication.",
    "project_learning_suna_04": "Capacité à produire un code fonctionnel et optimisé, même sous des délais restreints.",



    "project_title": "Nom du projet",
    "project_date": "2023 - 2024",
    "project_team_size": "Équipe de 4 personnes",
    
    "project_description_1": "Description principale du projet. Expliquez ici le concept, l'objectif et ce qui rend ce projet unique. Cette section devrait donner un aperçu clair de ce que fait le projet.",
    "project_description_2": "Deuxième paragraphe avec plus de détails sur les principales fonctionnalités, les défis techniques surmontés ou l'expérience utilisateur offerte.",
    
    "project_role_position": "Programmeur Réseau et Gameplay",
    "project_role_duration": "Janvier 2025 - Mai 2025",
    "project_role_description": "En tant que programmeur réseau et gameplay, j'étais responsable du développement de l'architecture réseau du jeu et de l'implémentation des mécaniques de gameplay multijoueur. Mon travail s'est concentré sur la création d'une expérience fluide et réactive pour tous les joueurs.",
    "project_role_responsibility_1": "Architecture et implémentation du système réseau multijoueur",
    "project_role_responsibility_2": "Développement des mécaniques de gameplay (tir, mouvement, interactions)",
    "project_role_responsibility_3": "Synchronisation de l'état du jeu entre les clients",
    "project_role_responsibility_4": "Optimisation des performances réseau et réduction de la latence",
    "project_role_responsibility_5": "Intégration et tests des fonctionnalités multijoueur",
    
    "project_feature_1_title": "Fonctionnalité 1",
    "project_feature_1_desc": "Description de la première fonctionnalité importante du projet.",
    "project_feature_2_title": "Fonctionnalité 2",
    "project_feature_2_desc": "Description de la deuxième fonctionnalité importante du projet.",
    "project_feature_3_title": "Fonctionnalité 3",
    "project_feature_3_desc": "Description de la troisième fonctionnalité importante du projet.",
    "project_feature_4_title": "Fonctionnalité 4",
    "project_feature_4_desc": "Description de la quatrième fonctionnalité importante du projet.",
    
    "project_challenge_1_title": "Défi technique 1",
    "project_challenge_1_desc": "Description du premier défi technique rencontré pendant le développement.",
    "project_challenge_1_code_caption": "Solution implémentée pour résoudre ce défi",
    "project_challenge_2_title": "Défi technique 2",
    "project_challenge_2_desc": "Description du deuxième défi technique rencontré pendant le développement.",
    "project_challenge_2_code_caption": "Extrait de code montrant la solution",
    "project_challenge_3_title": "Défi technique 3",
    "project_challenge_3_desc": "Description du troisième défi technique rencontré pendant le développement.",
    "project_challenge_3_solution_title": "Solution adoptée :",
    "project_challenge_3_solution_desc": "Explication détaillée de la solution implémentée pour résoudre ce défi.",
    
    "project_learnings_desc": "Décrivez ici les principales compétences acquises, les leçons apprises et comment ce projet a contribué à votre développement en tant que développeur.",
    "project_learning_1": "Premier apprentissage important",
    "project_learning_2": "Deuxième apprentissage important",
    "project_learning_3": "Troisième apprentissage important",
    "project_learning_4": "Quatrième apprentissage important",
    
    "project_other_projects_title": "Autres projets",
    "project_previous_title": "Projet précédent",
    "project_previous_desc": "Courte description du projet précédent",
    "project_next_title": "Projet suivant",
    "project_next_desc": "Courte description du projet suivant",

    "wip_title": "Cette page est en cours de construction",
    "wip_description": "Nous travaillons pour vous apporter quelque chose d'incroyable. Revenez bientôt pour des mises à jour !",
    "wip_back_home": "Retour à l'accueil",
    "wip_view_projects": "Voir les projets",

    "footer_copyright": "Tous droits réservés."
}